app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]

      if Artist.exists?(params[:artist_id])
        @artist = Artist.find(params[:artist_id])
        @songs = @artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end

    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if Song.find_by(id: params[:id]).nil? && params[:artist_id]
      flash[:alert] = "Song not found"
      redirect_to artist_songs_path(Artist.find(params[:artist_id]))